Core/src/DataProcessors/ПодтверждениеПоступившихКиЗГИСМ/ПодтверждениеПоступившихКиЗГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодтверждениеПоступившихКиЗГИСМ</name>
  <tabularSections>
    <name>НомераКиЗКПодтверждению</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DefinedType.ДокументПоступленияМаркированныхТоваровГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияОтправкиПодтвержденияГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.УведомлениеОПоступленииМаркированныхТоваровГИСМ</types>
        <types>DocumentRef.ЗаявкаНаВыпускКиЗГИСМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/Documents/ЗаявкаНаВыпускКиЗГИСМ/ЗаявкаНаВыпускКиЗГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаВыпускКиЗГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>DefinedType.НомерДокументаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаявкиНаВыпускКиЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияИзготовленныхКИЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляМаркировкиОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNКонтрагента</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказанныеКиЗ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыпущенныеКиЗ</name>
    <attributes>
      <name>ВидКиЗ</name>
      <type>
        <types>EnumRef.ВидыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DefinedType.ДокументПоступленияМаркированныхТоваровГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПодтверждения</name>
      <type>
        <types>EnumRef.СостоянияОтправкиПодтвержденияГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДляМаркировкиОстатков</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыпускаВОборот</name>
      <type>
        <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерКиЗ</name>
      <type>
        <types>EnumRef.РазмерыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыпуска</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/DataProcessors/ПодтверждениеПоступившихКиЗГИСМ/Forms/СписокПроблем/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПоДублям Тогда
	
		Если Параметры.СписокДублейКиЗ.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Заголовок = НСтр("ka='Дублирующиеся номера КиЗ';ru='Дублирующиеся номера КиЗ'");
		СписокДублейКиЗ      = Параметры.СписокДублейКиЗ;
		ПоЗаявкамНаВыпускКиЗ = Параметры.ПоЗаявкамНаВыпускКиЗ;
		
		ЗаполнитьТаблицуПроблем();
		
	ИначеЕсли Параметры.ПоПроблемамСопоставления Тогда
		
		ПереданнаяТаблица = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицаПроблемыСопоставления);
		Если ПереданнаяТаблица = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Заголовок = НСтр("ka='Номера КиЗ, несопоставленные заказанным';ru='Номера КиЗ, несопоставленные заказанным'");
		ТаблицаПроблемныхКиЗ.Загрузить(ПереданнаяТаблица);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПроблемныхКиЗ

&НаКлиенте
Процедура ТаблицаПроблемныхКиЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПроблемныхКиЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ЗаявкаНаВыпускКиЗ) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.ЗаявкаНаВыпускКиЗ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПроблем()

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаявкаНаВыпускКиЗГИСМВыпущенныеКиЗ.Ссылка КАК ЗаявкаНаВыпускКиЗ,
	|	ЗаявкаНаВыпускКиЗГИСМВыпущенныеКиЗ.НомерКиЗ КАК НомерКиЗ
	|ИЗ
	|	Документ.ЗаявкаНаВыпускКиЗГИСМ.ВыпущенныеКиЗ КАК ЗаявкаНаВыпускКиЗГИСМВыпущенныеКиЗ
	|ГДЕ
	|	ЗаявкаНаВыпускКиЗГИСМВыпущенныеКиЗ.Ссылка В(&СписокЗаявокНаВыпускКиЗ)
	|	И ЗаявкаНаВыпускКиЗГИСМВыпущенныеКиЗ.НомерКиЗ В(&СписокДублейКиЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("СписокДублейКиЗ", СписокДублейКиЗ);
	Если ПоЗаявкамНаВыпускКиЗ.Количество() > 0 Тогда
		
		Запрос.УстановитьПараметр("СписокЗаявокНаВыпускКиЗ",ПоЗаявкамНаВыпускКиЗ);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СписокЗаявокНаВыпускКиЗ", Обработки.ПодтверждениеПоступившихКиЗГИСМ.ТекстУсловияПоЗаявкамНаВыпускКиЗ());
		
	КонецЕсли;
	
	ТаблицаПроблемныхКиЗ.Загрузить(Запрос.Выполнить().Выгрузить());
 

КонецПроцедуры 

#КонецОбласти
